In [7]:
%matplotlib inline
import matplotlib.pyplot as plt
from math import sin
import pandas as pd
import os

In [8]:
accountDB = pd.read_csv('data/account.csv', sep=";")
accountDB

      account_id  district_id         frequency    date
0            576           55  monthly issuance  930101
1           3818           74  monthly issuance  930101
2            704           55  monthly issuance  930101
3           2378           16  monthly issuance  930101
4           2632           24  monthly issuance  930102
...          ...          ...               ...     ...
4495         124           55  monthly issuance  971228
4496        3958           59  monthly issuance  971228
4497         777           30  monthly issuance  971228
4498        1573           63  monthly issuance  971229
4499        3276            1  monthly issuance  971229

[4500 rows x 4 columns]

In [9]:
clientDB = pd.read_csv('data/client.csv', sep=";")
clientDB.insert(0, "women",(((clientDB['birth_number'] - ((clientDB['birth_number']//10000 * 10000) + (clientDB['birth_number'] - clientDB['birth_number']//100 * 100)))//100) > 50))
clientDB.insert(0,"age", 121- clientDB['birth_number']//10000)
clientDB

      age  women  client_id  birth_number  district_id
0      51   True          1        706213           18
1      76  False          2        450204            1
2      81   True          3        406009            1
3      65  False          4        561201            5
4      61   True          5        605703            5
...   ...    ...        ...           ...          ...
5364   76   True      13955        456030            1
5365   78  False      13956        430406            1
5366   53  False      13968        680413           61
5367   59   True      13971        626019           67
5368   68   True      13998        535812           74

[5369 rows x 5 columns]

In [10]:
dispositionDB = pd.read_csv('data/disp.csv', sep=";")
dispositionDB

      disp_id  client_id  account_id       type
0           1          1           1      OWNER
1           2          2           2      OWNER
2           3          3           2  DISPONENT
3           4          4           3      OWNER
4           5          5           3  DISPONENT
...       ...        ...         ...        ...
5364    13647      13955       11349      OWNER
5365    13648      13956       11349  DISPONENT
5366    13660      13968       11359      OWNER
5367    13663      13971       11362      OWNER
5368    13690      13998       11382      OWNER

[5369 rows x 4 columns]